OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
void handleNotFound(MongooseHttpServerRequest *request)
{
  // Not a dynamic handler, check the static resources
  if(web_static_handle(request)) {
    return;
  }

  DBUG("NOT_FOUND: ");
  dumpRequest(request);

  if(net.isWifiModeAp()) {
    // Redirect to the home page in AP mode (for the captive portal)
    MongooseHttpServerResponseStream *response = request->beginResponseStream();
    response->setContentType(CONTENT_TYPE_HTML);

    String url = F("http://");
    url += net.getIp();

    String s = F("<html>");
    s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
    s += url;
    s += F("\" /></head><body><a href=\"");
    s += url;
    s += F("\">OpenEVSE</a></body></html>");

    response->setCode(301);
    response->addHeader(F("Location"), url);
    response->print(s);
    request->send(response);
  } else {
    request->send(404);
  }
}

void handleHttpsRedirect(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response = request->beginResponseStream();
  response->setContentType(CONTENT_TYPE_HTML);

  String url = F("https://");
  url += request->host().toString();
  url += request->uri().toString();

  String s = F("<html>");
  s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
  s += url;
  s += F("\" /></head><body><a href=\"");
  s += url;
  s += F("\">OpenEVSE</a></body></html>");

  response->setCode(301);
  response->addHeader(F("Location"), url);
  response->print(s);
  request->send(response);
}

void onWsFrame(MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len)
{
  DBUGF("Got message %.*s", len, (const char *)data);
  const size_t capacity = JSON_OBJECT_SIZE(1) + 16;
  DynamicJsonDocument doc(capacity);
  DeserializationError error = deserializeJson(doc, data, len);
  if (!error) {
    if (doc.containsKey("ping") && doc["ping"].is<int8_t>())
      {
        // answer pong
        connection->send("{\"pong\": 1}");

      }
  }
}

// Websocket auth gate.
//
// On Mongoose 6 the library dispatched the handshake request to the endpoint's
// onRequest handler, so onWsAuthenticate() could answer 401 before the upgrade.
// The Mongoose 7 library performs mg_ws_upgrade() inside the connection's
// constructor, so no request handler can run first and that gate is unreachable
// here. The handshake request is duplicated into the connection though
// (MG_COPY_HTTP_MESSAGE), so its Authorization/Cookie headers are still
// readable at connect time — check them here and drop an unauthenticated client
// before it is sent anything.
//
// Difference from the Mongoose 6 path: the client sees the 101 followed by an
// immediate close rather than a 401. Nothing is served either way.
static bool wsAuthorise(MongooseHttpWebSocketConnection *connection)
{
  if(isAuthenticated(connection)) {
    return true;
  }

  DBUGF("Rejecting unauthenticated websocket client");
  // MongooseSocket::disconnect() is protected, so drain the underlying
  // connection directly — same effect, and getConnection() is public.
  connection->getConnection()->is_draining = 1;
  return false;
}

void onWsConnect(MongooseHttpWebSocketConnection *connection)
{
  if(false == wsAuthorise(connection)) {
    return;
  }

  DBUGF("New client connected over ws");

  DynamicJsonDocument doc(STATUS_JSON_CAPACITY);
  buildStatus(doc);

  // Send only to the client that just connected. This used to call
  // web_server_event(), which broadcasts to every open websocket -- so one
  // client reconnecting pushed a full status to all of them. Under a
  // reconnect storm (a Home Assistant integration retrying, say) that
  // multiplies into a burst of full-status sends against connections that
  // never asked for one, straight into send buffers with no backpressure.
  String json;
  json.reserve(measureJson(doc) + 1);
  serializeJson(doc, json);
  connection->send(json);
}

/*
 * Really simple 'conversion' of ASCII to UTF-8, basically only a few places send >127 chars
 * so just filter those to be acceptable as UTF-8
 */
static void web_server_send_all(const char *endpoint, const uint8_t *buffer, size_t size)
{
  if(http_server_started) {
    http_server.sendAll(endpoint, WEBSOCKET_OP_TEXT, buffer, size);
  }
  if(https_server_started) {
    https_server.sendAll(endpoint, WEBSOCKET_OP_TEXT, buffer, size);
  }
}

void web_server_send_ascii_utf8(const char *endpoint, const uint8_t *buffer, size_t size)
{
  char temp[size];
  for(int i = 0; i < size; i++) {
    temp[i] = buffer[i] & 0x7f;
  }
  web_server_send_all(endpoint, (const uint8_t *)temp, size);
}

void handleMqttAction(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if (false == requestPreProcess(request, response)) return;

  if (HTTP_GET == request->method()) {
    DynamicJsonDocument doc(JSON_OBJECT_SIZE(8) + 384);
    doc["mqtt_connected"] = (int)mqtt.isConnected();
    doc["mqtt_status"]    = mqtt.getMqttStatus();
    if (mqtt.getBrokerIp()[0] != '\0')
      doc["mqtt_broker_ip"]      = mqtt.getBrokerIp();
    if (mqtt.getBrokerVersion()[0] != '\0')
      doc["mqtt_broker_version"] = mqtt.getBrokerVersion();
    if (mqtt.getConnectedSince() > 0)
      doc["mqtt_connected_since"] = (uint32_t)mqtt.getConnectedSince();
    if (mqtt.getLastRxTime() > 0)
      doc["mqtt_last_rx"]         = (uint32_t)mqtt.getLastRxTime();
    // Always include error fields (empty string when no failure) so the GUI can
    // clear a previously-shown reason once reconnected.
    doc["mqtt_error"]        = mqtt.getErrorCategory();
    doc["mqtt_error_detail"] = mqtt.getErrorDetail();
    response->setCode(200);
    serializeJson(doc, *response);
  } else if (HTTP_POST == request->method()) {
    mqtt.restartConnection();
    response->setCode(200);
    response->print("{\"msg\":\"done\"}");
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }
  request->send(response);
}

static void registerWebServerRoutes(MongooseHttpServer &server)
{
  // Server startup (and the HTTP->HTTPS redirect) now lives in
  // web_server_setup(), which registers these routes against both the HTTP and
  // the HTTPS server, so it must not be repeated per-registration here.

  // Session management (no auth gate — user must reach these unauthenticated)
  server.on("/login", handleLogin);
  server.on("/logout", handleLogout);

  // Handle status updates
  server.on("/status", handleStatus);
  server.on("/config", handleConfig);

  // Handle HTTP web interface button presses
  server.on("/teslaveh", handleTeslaVeh);
  server.on("/tesla/vehicles", handleTeslaVeh);
  server.on("/settime", handleSetTime);
  server.on("/reset", handleRst);
  server.on("/restart", handleRestart);
  server.on("/rapi", handleRapi);
  server.on("/r", handleRapi);
  server.on("/scan", handleScan);
  server.on("/apoff", handleAPOff);
  server.on("/divertmode", handleDivertMode);
  server.on("/shaper", handleCurrentShaper);
  server.on("/emoncms/describe", handleDescribe);
  server.on("/rfid/add", handleAddRFID);

  server.on("/schedule/plan", handleSchedulePlan);
  server.on("/schedule", handleSchedule);

  server.on("/claims/#", handleEvseClaims);
  server.on("/claims/target", handleEvseClaimsTarget);
  server.on("/claims", handleEvseClaims);

  server.on("/override", handleOverride);

  server.on("/logs", handleEventLogs);
  server.on("/certificates/#", handleCertificates);
  server.on("/certificates", handleCertificates);
  server.on("/limit", handleLimit);
  server.on("/emeter", handleEmeter);
  server.on("/time", handleTime);
  server.on("/mqtt", handleMqttAction);

#ifndef ENABLE_TSDB
  server.on("/energy/raw", handleEnergyRaw);
  server.on("/energy/daily", handleEnergyDaily);
  server.on("/energy/monthly", handleEnergyMonthly);
  server.on("/energy/annual", handleEnergyAnnual);
#else // ENABLE_TSDB
  server.on("/energy/raw", handleEnergyRaw);
  server.on("/energy/daily", handleEnergyDaily);
  server.on("/energy/weekly", handleEnergyWeekly);
  server.on("/energy/monthly", handleEnergyMonthly);
  server.on("/energy/annual", handleEnergyAnnual);
#endif // ENABLE_TSDB

  // Simple Firmware Update Form
  server.on("/update")->
    onRequest(handleUpdateRequest)->
    onUpload(handleUpdateUpload)->
    onClose(handleUpdateClose);

  // In-place 16MB flash repartition (16MB module flashed with 4MB layout)
  server.on("/migrate/expand16mb", handleMigrateExpand16mb);
  server.on("/migrate/status", handleMigrateStatus);
  server.on("/migrate/coredump", handleMigrateCoredump);

  server.on("/debug", [](MongooseHttpServerRequest *request) {
    MongooseHttpServerResponseStream *response;
    if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
      return;
    }

    response->setCode(200);
    response->setContentType(CONTENT_TYPE_TEXT);
    response->addHeader("Access-Control-Allow-Origin", "*");
    SerialDebug.printBuffer(*response);
    request->send(response);
  });

  server.on("/debug/console", [](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
    // Intentionally no-op: this endpoint is server-push only via SerialDebug.onWrite.
  })->onConnect([](MongooseHttpWebSocketConnection *connection) {
    wsAuthorise(connection);
  });

  SerialDebug.onWrite([](const uint8_t *buffer, size_t size)
  {
    web_server_send_all("/debug/console", buffer, size);
  });

  server.on("/evse", [](MongooseHttpServerRequest *request) {
    MongooseHttpServerResponseStream *response;
    if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
      return;
    }

    response->setCode(200);
    response->setContentType(CONTENT_TYPE_TEXT);
    response->addHeader("Access-Control-Allow-Origin", "*");
    SerialEvse.printBuffer(*response);
    request->send(response);
  });

  server.on("/evse/console", [](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
    // Intentionally no-op: this endpoint is server-push only via SerialEvse callbacks.
  })->onConnect([](MongooseHttpWebSocketConnection *connection) {
    wsAuthorise(connection);
  });

  SerialEvse.onWrite([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });
  SerialEvse.onRead([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });

  // onWsConnect() applies the auth gate; see wsAuthorise().
  server.on("/ws", onWsFrame)->onConnect(onWsConnect);
}

void web_server_setup()
{
  http_server_started = false;
  https_server_started = false;

  bool use_ssl = false;
  if(config_https_enabled() && www_certificate_id != "")
  {
    uint64_t cert_id = std::stoull(www_certificate_id.c_str(), nullptr, 16);
    const char *cert = certs.getCertificate(cert_id);
    const char *key = certs.getKey(cert_id);
    if(NULL != cert && NULL != key)
    {
      DEBUG.printf("Starting HTTPS server, https://0.0.0.0:%d\n", www_https_port);
      https_server.begin(www_https_port, cert, key);
      registerWebServerRoutes(https_server);
      https_server.onNotFound(handleNotFound);
      https_server_started = true;
      use_ssl = true;
    }
  }

