OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  // Keep HTTP reachable whenever HTTPS is unavailable, so we never strand the UI.
  const bool should_start_http = config_http_enabled() || false == use_ssl;
  const bool should_bind_http_port = false == use_ssl || www_http_port != www_https_port;
  if(should_start_http && should_bind_http_port) {
      DEBUG.printf("Starting HTTP server, http://0.0.0.0:%d\n", www_http_port);
      http_server.begin(www_http_port);
      registerWebServerRoutes(http_server);
      http_server.onNotFound(handleNotFound);
      http_server_started = true;
  }

  DEBUG.println("Server started");
}

void
web_server_loop() {
  Profile_Start(web_server_loop);

  // Do we need to restart the WiFi?
  if(wifiRestartTime > 0 && millis() > wifiRestartTime) {
    wifiRestartTime = 0;
    net.wifiRestart();
  }

  // Do we need to turn off the access point?
  if(apOffTime > 0 && millis() > apOffTime) {
    apOffTime = 0;
    net.wifiTurnOffAp();
  }

  Profile_End(web_server_loop, 5);
}

void web_server_event(JsonDocument &event)
{
  String json;
  // Reserve up front: the default String growth pattern reallocates on almost
  // every append, and exact-fit reallocs at this frequency are what shreds the
  // heap into unusable fragments.
  json.reserve(measureJson(event) + 1);
  serializeJson(event, json);

  // Drop any client that has stopped draining before adding to its backlog.
  diagnostics_ws_reap();

  if(http_server_started) {
    http_server.sendAll("/ws", json);
  }
  if(https_server_started) {
    https_server.sendAll("/ws", json);
  }
}
